---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussLayoutNonSympleTopChord
source: html/7f31a2b9-8d1c-23af-3877-7566c21d70ef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussLayoutNonSympleTopChord Property

This truss layout family defines an offset or non horizontal top chord. This may conflict with attachment or profile editing.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussLayoutNonSympleTopChord { get; }
```